#include <stdio.h> 
#include <stdlib.h>
#include <math.h>
#include <float.h>

/*
int main()
{
//浮点型转二进制 2025.10.7
	//1、符号不用管，留着就行
	//2、正数部分直接转 2 进制：
	//3、小数部分转 2 进制：乘 2 取整数部分，直到小数乘尽
		//-1234.456             77.25
		//10011010010.          1001101.
		//0.456 * 2 == 0.912 0  0.25 * 2 == 0.50 0
		//0.912 * 2 == 1.824 1  0.50 * 2 == 1.00 1
		//0.824 * 2 == 1.648 1  0.00 * 2 == 0.00 乘尽了
		//0.648 * 2 == 1.296 1  77.25 的二进制 1001101.01
		//0.296 * 2 == 0.592 0
		//0.592 * 2 == 1.184 1
		//0.184 * 2 == 0.368 0
		//0.368 * 2 == 0.736 0
		//0.736 * 2 == 1.472 1
		//0.472 * 2.... 乘不尽
		//- 1234.456 的二进制 -10011010010.011101001....

//浮点型符号位存储
	//浮点型存储是以科学记数法的形式存储各个属性的
		//-10011010010.011101001.... -> -1.0011010010011101001 * 2^10
		//+1001101.01 -> +1.00110101 * 2^6
	//有三个属性：符号：正负号、阶数，最高位符号位，负数为 1，正数为 0
		//4 字节 32 位： float 存储方式：符号位（1b）阶数位（8b）数据位（23b）
		//8 字节 64 位：double 存储方式：符号位（1b）阶数位（11b）数据位（52b）

//指数设定 1，全为 0
	//阶数位按照 ieee754 标准存储
	//阶数全是 0，尾数随意，表示+0.0 或者-0.0，无限趋近于 0.0 的数，所以浮点型可以除 0.0
	//*(int*)&a 是一种类型双关的技巧，绕过了类型系统，通过改变内存解释方式来修改 a 的值，使得他的阶数位为 0
	float a = 1.2f;
	*(int*)&a = 0x80076ab3;//1000 0000 0000 0111 0110 1010 1011 0011
	printf("%f\n", a);
	float c = 0.0;
	printf("%e\n", 2.0 / c); //是合法的，结果是无穷大，输出 inf

//指数设定 2，全为 1，尾数表示无穷
	//阶数全是 1，尾数全是 0 表示无穷，符号位是 1，表示无穷小，符号位是 0，表示无穷大，输出符号 inf，全称 Infinite
	float f = 0.0f;
	*(int*)&f = 0xff800000;//1111 1111 1000 0000 0000 0000 0000 0000
	printf("%e\n", f); //输出 -inf 无穷小
	*(int*)&f = 0x7f800000;//0111 1111 1000 0000 0000 0000 0000 0000
	printf("%e\n", f); //输出 inf 无穷大
	double ff = 0.0;
	*(long long*)&ff = 0xfff0000000000000;
	printf("%lf\n", ff); //输出 -inf
	float b = 0.0;
	float d = 2.0 / b; //float d = 2.0 / 0.0;直接操作会报错
	printf("%x\n", *(int*)&d); //7f800000

//指数设定 3，全为 1，尾数不全为 0，nan
	//阶数全是 1，尾数非全是 0，表示非法数，输出符号 NAN，nan，全称 not a number，表示未定义或无效的操作
	float g = 0.0f;
	*(int*)&g = 0xff900000;//1111 1111 1001 0000 0000 0000 0000 0000
	printf("%f\n", g); //输出-nan
	*(int*)&g = 0x7f900000;//0111 1111 1001 0000 0000 0000 0000 0000
	printf("%f\n", g); //输出 nan
	double gg = 0.0;
	*(long long*)&gg = 0xfff8000000000000;//1111 1111 1111 1000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000
	printf("%lf\n", gg); //输出-nan(ind) indeterminate 不确定	
	*(long long*)&gg = 0x7ff8000000000000;//0111 1111 1111 1000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000
	printf("%lf\n", gg); //输出 nan
	//非正经数，比如 - 1 开平方
	float h = sqrt(-1);
	printf("%x, %lf\n", *(int*)&h, h); //输出 ffc00000 -nan(ind)

//阶数位的正常值计算
	//32 位浮点型阶数的 2 进制范围是：0000 0001（-（2^位数 - 2）） 到 1111 1110（2^位数 - 1），000 0000 0000 与 111 1111 1111用作表示特殊情况
	//按照非标准移码存储，即标准移码，再减 1，标准移码是补码的符号位取反
	//将非标准移码存储的阶数 + 中位数（2^位数 - 1），再将结果转换为二级制即可，如2 的指数是 - 115，其二进制为 - 115 + 127 == 12，所以阶数的二进制为 0000 1100
		//-1234.456                                                   77.25
		//-10011010010.011101001... -> -1.0011010010011101001 * 2^10  1001101.01 -> +1.00110101 * 2^6
		//前者阶数位是：10 + 127，即 137，10001001 ，加上符号位，前九位：1100 0100 1
		//后者阶数位是：6 + 127，即 133，10000101 ，加上符号位，前九位：0100 0010 1
	float i = -1234.456f, j = 77.25f;
	printf("%x %x\n", *(int*)&i, *(int*)&j);
	//64 位浮点型阶数的 2 进制范围是：000 0000 0001 到 111 1111 1110，与 32 位同理
		//-1234.456                                                   77.25
		//-10011010010.011101001... -> -1.0011010010011101001 * 2^10  1001101.01 -> +1.00110101 * 2^6
		//前者阶数位是：10 + 1023，即 1033，100 0000 1001，加上符号位，前 12 位：1100 0000 1001
		//后者阶数位是：6 + 1023，即 1029，100 0000 0101，加上符号位，前 12 位：0100 0000 0101
	double k = -1234.456, l = 77.25;
	printf("%llx %llx\n", *(long long*)&k, *(long long*)&l);

//尾数位的存储
	//因为总是 1.xxxxxx，所以这个 1 默认就有，即隐藏了，不需要存储
	//-1234.456                                                   77.25
	//-10011010010.011101001... -> -1.0011010010011101001 * 2^10  1001101.01 -> +1.00110101 * 2^6
	//前者存储的就是 0011010010011101001.....共 23 个，实际逻辑存储 24 位。因为是无限的，算不尽，所以此时只能存储 24 个位，即不精确存储。
	//后者存储的就是 00110101，这个因为算的尽，并且在 23 个内，所以是精确存储的，也就是说，不是所有的浮点型都不精确存储，但是统一当不精确存储处理。后面补够 23 位，都是 0。

//float 类型范围
	//正最大值：0111 1111 0111 1111 1111 1111 1111 1111 0x7f7fffff
	//负最小值：1111 1111 0111 1111 1111 1111 1111 1111 0xff7fffff
	float m = 0.0;
	float n = 0.0;
	*(int*)&m = 0x7f7fffff;//0111 1111 0111 1111 1111 1111 1111 1111
	*(int*)&n = 0xff7fffff;//1111 1111 0111 1111 1111 1111 1111 1111
	printf("%e %e\n", m, n);//转定义 float.h 查看对比
	//正最小值：0000 0000 1000 0000 0000 0000 0000 0000 0x00800000
	//负最大值：1000 0000 1000 0000 0000 0000 0000 0000 0x80800000
	float mm = 0.0;
	float nn = 0.0;
	*(int*)&mm = 0x00800000;//0000 0000 1000 0000 0000 0000 0000 0000
	*(int*)&nn = 0x80800000;//1000 0000 1000 0000 0000 0000 0000 0000
	printf("%e %e\n", mm, nn);

//double 类型范围
	//正最大值：0111 1111 1110 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 0x7fefffffffffffff
	//负最小值：1111 1111 1110 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 0xffefffffffffffff
	double o = 0.0;
	double p = 0.0;
	*(long long*)& o = 0x7fefffffffffffff;//0111 1111 1110 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111
	*(long long*)&p = 0xffefffffffffffff;//1111 1111 1110 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111
	printf("%e %e\n", o, p);//转定义 float.h 查看对比
	//正最小值：0000 0000 0001 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0x0010000000000000
	//负最大值：1000 0000 0001 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0x8010000000000000
	double oo = 0.0;
	double pp = 0.0;
	*(long long*)&oo = 0x0010000000000000;//0000 0000 0001 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000
	*(long long*)&pp = 0x8010000000000000;//1000 0000 0001 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000
	printf("%e %e\n", oo, pp);

//浮点型的精度位计算 2025.10.8
	//浮点型存储分精确存储与不精确存储
		//精确存储的数：2 的 n 次方，以及多个加和，其二进制中的 1 的排序刚好在 24 位或者 53位尾数装的下，没有超出 float double 的范围，因此没有多于截断，所以精确存储。
		//不精确存储的数：由于其二进制个数无限，存储有限，所以不精确。
	float q = pow(2, -64);
	printf("%.80f\n", q);//0.00000000000000000005421010862427522170037264004349708557128906250000000000000000 精确的输出其所有数位。
	//float 类型，其尾数位是 23 位 + 1 位隐藏位，总 24 位。从 2 进制角度来说就是 24 个有效 2 进制位；从 10 进制角度来说，就是8 位 10 进制数，所以其精度是 8 位，最后一位为后一位的四舍五入，所以前 7 位是精确的，标准规定不小于 6 位
	//double 类型同理，53 个尾数位，其表示的最大 10 进制数是 16 位，标准规定不小于 10 位。类比 2 进制与 16 进制，16 个 2 进制位，就是 4 个 16 进制，5 个 10 进制，6 个 8 进制，。

//浮点型实现相等比较
	//由于平时给个小数，不能直接口算出其是否是精确存储，所以统一模糊处理，认为都是不精确存储。
	//因为是不精确存储，2.4f + 3.2f != 5.6f，5.6f 存储为 5.5999999999999996
	//所以当 5.6 + N >= r >= 5.6 - N 时，可以认为 r == 5.6
	#define N 0.0001 //自我设定精度 N ，调整 N，以调整比较精度
	double r = 5.6;
	if (5.6 + N >= r && r >= 5.6 - N)
	{
		printf("%.16f\n", r);//输出 5.5999999999999996
	}

//判断浮点型是否正常
	double s = 0.0;
	double t = 5.6 / s;
	double u = sqrt(-1);
	printf("%e %d\n", t, isinf(t)); //是 inf 返回 1，正常返回 0 
	printf("%e %d\n", u, isnan(u)); //是 nan 返回 1，正常返回 0 

//浮点型 16 进制形式 %a
	//浮点型 16 进制表示法 ：(c99 p 记法) 与科学记数法类似
	//以 0xa.23p5 为例
		//p5 就是 2 的 5 次方，即 32
		//a    -> 10 * 1 * 32 320 = 320
		//0.2  -> 2 * (1 / 16) * 32 = 4
		//0.03 -> 3 * (1 / 256) * 32 0.375
		//320 + 4 + 0.375 == 324.375
	float v = 12.13f;
	printf("%a %f\n", v, v);
	float w = 0x1.8428f60000000p+3;
	printf("%a %f\n", w, w);
	float x = 0xa.23p5f;
	printf("%a %f\n", x, x);//输出结果可以改用1.输出，a23 -> 1.446 1010 0010 0011 -> 1 0100 0100 0110

//浮点型 16进制 2 进制转换
	//16 进制转 2 进制
		//0xa.23p5
		//a：1010 2：0010 3：0011 -> 1010.00100011，p5 是乘 2 的 5 次方，小数点后移 5 位，即最后结果为 101000100.011
	//2 进制转 16 进制
		//101000100.011 -> 1010 0010 0011 x 2^-3 -> a 2 3 x 2^-3 -> 0xa23p^-3 -> 0xa.23p^+5（小数点向前移动了 8 位）
	//10 进制转 16 进制：可以先转成 2 进制，再转 16 进制

	system("pause");
	return 0;
}
*/