#include <stdio.h> 
#include <stdlib.h> 

/*
int main(void)
{
//算数运算符 2025.8.29
	//除法：/ 整数取整，小数除法 5.0/2 先将2->2.0
	//取余：% 只能用于整数
	int a = 2 + 4, c = -1;
	float b = 3.0;
	printf("%d %d %d %d %d %f %d %d\n", a, a + 2, a - 2, a * (2 + 3), a / 4, b / 2.0, a % 4, -c);

//小括号运算符
	printf("%d %d\n", (4 + 5) * (3 - 2), 4 + 5 * 3 - 2);

//优先级和结合性
	//见运算符表 运算符-运算符表

//复合赋值运算符
	int d = 5;
	d += 3;//即 a = a + 3; a 变 8 左操作数必须是变量，因为要赋值
	printf("%d\n",d);
	d -= 3;//即 a = a - 3; a 变 2 左操作数必须是变量，因为要赋值
	printf("%d\n", d);
	d *= 3;//即 a = a * 3; a 变 15 左操作数必须是变量，因为要赋值
	printf("%d\n", d);
	d /= 3;//即 a = a / 3; a 变 1 左操作数必须是变量，因为要赋值
	printf("%d\n", d);
	d %= 3;//即 a = a % 3; a 变 2 左操作数必须是变量，因为要赋值
	printf("%d\n", d);

//前置++与后置++ 优先级：后置++>前置++
	int e = 2;
	e++;
	printf("%d\n", e);
	++e;
	printf("%d\n", e);
	int f = 2, g = 0, h = 0;
	g = f++ + 4;//后置++用自加前的值参与运算
	h = ++f + 4;//前置++用自加后的值参与运算
	printf("%d %d %d\n", f, g, h);

//前置--与后置-- 优先级：后置-->前置--
	//后置--用自减前的值参与运算
	//前置--用自减后的值参与运算

//自加自减运算符注意点
	//同一条语句中，出现了1个变量 a\a++\++a\--a\a--，就不能再出现 a++ a-- --a ++a 等表达式，不同的编译器运行结果不一样。只能出现单一。
	int n = 2, m = n + 3 + ++n;//不同的编译器运行结果不一样 如gcc下该表达式结果会于vs下不同
	printf("%d %d\n", n, m);

//关系运算符
	int o = 10 < 20; //10 < 20 为 1，将 1 赋值给 o
	int p = (10 > 20) + o; //10 > 20 为 0，0+o 赋值给 p
	printf("%d %d %d\n",o ,p, 10 != 20);

//逻辑运算符
	//C语言规定，非 0 即真，0 即假
	//真：50.3，a + b - 4， - 3，‘w’ 等等，均为真  假：0
	//与(&&)、或(|| )、非(!) 优先级：非(!) > 与(&&) > 或(||)
	//真&&真为1，真&&假为0，假&&真为0，假&&假为0 
	//真||真为1，真||假为1，假||真为 1，假||假为0
	//!真为0，!假为真
	a = 5 - 9 * 2 && 5 - 5;
	e = !0;
	c = 20 || 0;
	d = !(5 - 5) + 3 && 0;//加分优先级>与(&&)
	printf("%d %d %d %d\n", a, e, c, d);

//判断范围的写法
	//错误写法：20 < a < 40 a=50时，20 < a 为真，结果是1，然后1 < 40为真，结果是1，所以最终结果是1，不合逻辑
	//正确写法：20 < a && a < 40
	
//逗号运算符
	a = 1, d = 2, c = 3;
	a += 1, 2 + c, d += 1, a + d + c + 2;//从左到右依次执行 运行结果为a + d + c + 2
	a = 1, d = 2, c = 3;
	int r = (a += 1, 2 + c, d += 1, a + d + c + 2);
	printf("%d\n", r);

	system("pause");
	return 0;
}
*/