#include <stdio.h> 
#include <stdlib.h> 

/*
int main(void)
{
//一维数组的声明与初始化 2025.9.1
	int a[10];
	int b[10] = {6,4,7,3,8,3,2,8,1,0}; //初始化形式，最多初始化 10 个元素
	int c[10] = {6,4,7,3,8}; //初始化部分元素，其他元素默认初始化成 0
	int d[10] = {0}; //10 个元素全部初始化 0
	int e[] = {6,4,7,3}; //初始化时可不写元素个数，系统根据元素多少自定

//数组定义注意点
	//默认最大申请不能超过 1M
	//所有元素都是相邻的，是一块连续的内存空间

//数组元素访问
	int f[5] = {4,2,7,8,4};//5个元素的标号依次是：0,1,2,3,4 最大下标是元素个数-1，即5-1
	printf("%d %d %d %d %d\n", f[0], f[1], f[2], f[3], f[4]);
	f[0] = 6, f[1] = 5, f[2] = 3, f[3] = 9, f[4] = 0;
	printf("%d %d %d %d %d\n", f[0], f[1], f[2], f[3], f[4]);

//循环遍历数组
	int i;
	for (i = 0; i < 5; i++)
		printf("%d\n", f[i]);

//数组大小
	printf("%zu %zu\n", sizeof(f), sizeof(int[5]));

//二维数组简介
	int u[3][5];//可理解为行列，int a[行][列]

//二维数组初始化
	int k[3][2] = { {3,2},
		            {6,5},
		            {8,7} }; //内部大括号对应每个小一维数组 "3 2 6 5 8 7"
	int l[3][2] = { {3},{9},{8,7} }; //初始化部分元素，其他默认0 "3 0 9 0 8 7"
	int m[3][2] = { 3,9,8 }; //没有内部大括号，就依次初始化各元素，其他为0 "3 9 8 0 0 0"
	int n[][2] = { 3,9,8 }; //初始化时，可不写行，系统根据数据个数计算行，2行  "3 9 8 0"

//二维数组的下标
	//行下标与列下标，都是从0开始
	//a[0]是第 1 个小数组的数组名字，a[1]是第 2 个小数组的数组名字，a[2]是第 3 个小数组的数组名字
	int o[3][4] = { {1,2,3,4},//a[0][0] a[0][1] a[0][2] a[0][3]
		            {5,6,7,8},//a[1][0] a[1][1] a[1][2] a[1][3]
		            {9,10,11,12} };//a[2][0] a[2][1] a[2][2] a[2][3]

//二维数组的遍历
	int j;
	for (i = 0; i < 3; i++)//按行输出
	{
		for (j = 0; j < 4; j++)
		{
			printf("%d ", o[i][j]);
		}
		putchar('\n');
	}

//二维数组元素操作
	int p[3][4] = { {1,3,7,42},
					{5,7,7,11},
					{9,1,3,12} };
	for (i = 0; i < 3; i++)//遍历赋值
	{
		for (j = 0; j < 4; j++)
		{
			o[i][j] = p[i][j];
		}
	}
	scanf_s("%d", &o[0][0]);//单个赋值

//二维数组大小
	printf("%zd %zd", sizeof(p), sizeof(int[3][4]));

	system("pause");
	return 0;
}
*/